01-ahmed-body/cases/slant20_re4.18M_symtest/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     foamRun;

solver          incompressibleFluid;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

// Short steady sanity-check for 10deg, per the case-matrix protocol:
// not a full convergence run, just checking for gross setup errors
// (bad BCs, mesh/field mismatches) before proceeding to transient
// PIMPLE, given 0deg and 25deg both showed genuine steady-RANS
// non-convergence via a real limit cycle.
endTime         300;
deltaT          1;
writeControl    timeStep;
writeInterval   50;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

functions
{
    #include "forceCoeffs"
}

// ************************************************************************* //
