01-ahmed-body/cases/slant20_re4.18M_symtest/system/surfaceFeaturesDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      surfaceFeaturesDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

surfaces ("ahmedBody.stl");

// DIAGNOSTIC ONLY -- NOT USED BY THE MESH (per the 10deg-case
// correction, README Section 10.6): snappyHexMeshDict's "features"
// list is empty for every case in this project, so the .eMesh file
// this produces is never read by snappyHexMesh. This sweep is run
// purely as a geometric characterization tool -- to identify this
// body's real sharp edges and their included angles -- which is then
// used to reason about resolveFeatureAngle (a separate parameter,
// see snappyHexMeshDict) rather than to configure feature snapping.
includedAngle   90;

subsetFeatures
{
    nonManifoldEdges    yes;
    openEdges           yes;
}

// ************************************************************************* //
